'{"class_name": "Functional", "config": {"name": "model_3", "layers": [{"class_name":
  "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32",
  "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes":
  []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28,
  1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name":
  "input_4", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape":
  [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name":
  "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "InputLayer",
  "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse":
  false, "ragged": false, "name": "input_6"}, "name": "input_6", "inbound_nodes":
  []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28,
  1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "name":
  "input_7", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape":
  [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name":
  "input_8"}, "name": "input_8", "inbound_nodes": []}, {"class_name": "InputLayer",
  "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse":
  false, "ragged": false, "name": "input_9"}, "name": "input_9", "inbound_nodes":
  []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28,
  1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_10"}, "name":
  "input_10", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape":
  [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name":
  "input_11"}, "name": "input_11", "inbound_nodes": []}, {"class_name": "InputLayer",
  "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse":
  false, "ragged": false, "name": "input_12"}, "name": "input_12", "inbound_nodes":
  []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28,
  1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_13"}, "name":
  "input_13", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape":
  [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name":
  "input_14"}, "name": "input_14", "inbound_nodes": []}, {"class_name": "InputLayer",
  "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse":
  false, "ragged": false, "name": "input_15"}, "name": "input_15", "inbound_nodes":
  []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28,
  1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_16"}, "name":
  "input_16", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape":
  [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name":
  "input_17"}, "name": "input_17", "inbound_nodes": []}, {"class_name": "InputLayer",
  "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse":
  false, "ragged": false, "name": "input_18"}, "name": "input_18", "inbound_nodes":
  []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28,
  1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_19"}, "name":
  "input_19", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape":
  [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name":
  "input_20"}, "name": "input_20", "inbound_nodes": []}, {"class_name": "InputLayer",
  "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse":
  false, "ragged": false, "name": "input_21"}, "name": "input_21", "inbound_nodes":
  []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28,
  1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_22"}, "name":
  "input_22", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape":
  [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name":
  "input_23"}, "name": "input_23", "inbound_nodes": []}, {"class_name": "InputLayer",
  "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse":
  false, "ragged": false, "name": "input_24"}, "name": "input_24", "inbound_nodes":
  []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28,
  1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_25"}, "name":
  "input_25", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape":
  [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name":
  "input_26"}, "name": "input_26", "inbound_nodes": []}, {"class_name": "InputLayer",
  "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse":
  false, "ragged": false, "name": "input_27"}, "name": "input_27", "inbound_nodes":
  []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28,
  1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_28"}, "name":
  "input_28", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape":
  [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name":
  "input_29"}, "name": "input_29", "inbound_nodes": []}, {"class_name": "InputLayer",
  "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse":
  false, "ragged": false, "name": "input_30"}, "name": "input_30", "inbound_nodes":
  []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28,
  1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_31"}, "name":
  "input_31", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape":
  [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name":
  "input_32"}, "name": "input_32", "inbound_nodes": []}, {"class_name": "InputLayer",
  "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse":
  false, "ragged": false, "name": "input_33"}, "name": "input_33", "inbound_nodes":
  []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28,
  1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_34"}, "name":
  "input_34", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name":
  "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape":
  [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name":
  "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config":
  {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size":
  [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate":
  [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 33},
  "bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}}, "kernel_regularizer":
  null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint":
  null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["input_1",
  0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation", "trainable":
  true, "dtype": "float32", "activation": "relu"}, "name": "activation", "inbound_nodes":
  [[["conv2d", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape",
  "trainable": true, "dtype": "float32", "target_shape": [28, 28, 16, 1]}, "name":
  "reshape", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"class_name": "Conv2D",
  "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters":
  32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format":
  "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias":
  true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null},
  "shared_object_id": 38}, "bias_initializer": {"class_name": "Constant", "config":
  {"value": 0.1}, "shared_object_id": 39}, "kernel_regularizer": null, "bias_regularizer":
  null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint":
  null}, "name": "conv2d_1", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"class_name":
  "ZeroPadding3D", "config": {"name": "zero_padding3d", "trainable": true, "dtype":
  "float32", "padding": [[0, 0], [0, 0], [0, 16]], "data_format": "channels_last"},
  "name": "zero_padding3d", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name":
  "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32",
  "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["conv2d_1", 0,
  0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable":
  true, "dtype": "float32", "target_shape": [28, 28, 32]}, "name": "reshape_1", "inbound_nodes":
  [[["zero_padding3d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2",
  "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides":
  [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1,
  1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 38},
  "bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}, "shared_object_id":
  39}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes":
  [[["activation_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add",
  "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["reshape_1",
  0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name":
  "activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name":
  "activation_2", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "Conv2D",
  "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters":
  32, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format":
  "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias":
  true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
  "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer":
  null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint":
  null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["activation_2",
  0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable":
  true, "dtype": "float32", "target_shape": [14, 14, 32, 1]}, "name": "reshape_2",
  "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config":
  {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size":
  [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate":
  [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 51},
  "bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}, "shared_object_id":
  52}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes":
  [[["activation_2", 0, 0, {}]]]}, {"class_name": "ZeroPadding3D", "config": {"name":
  "zero_padding3d_1", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0,
  0], [0, 32]], "data_format": "channels_last"}, "name": "zero_padding3d_1", "inbound_nodes":
  [[["reshape_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3",
  "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3",
  "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Reshape", "config":
  {"name": "reshape_3", "trainable": true, "dtype": "float32", "target_shape": [14,
  14, 64]}, "name": "reshape_3", "inbound_nodes": [[["zero_padding3d_1", 0, 0, {}]]]},
  {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype":
  "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same",
  "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation":
  "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform",
  "config": {"seed": null}, "shared_object_id": 51}, "bias_initializer": {"class_name":
  "Constant", "config": {"value": 0.1}, "shared_object_id": 52}, "kernel_regularizer":
  null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint":
  null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["activation_3",
  0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true,
  "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["reshape_3", 0, 0, {}],
  ["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_4",
  "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_4",
  "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name":
  "conv2d_8", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size":
  [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate":
  [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name":
  "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_8", "inbound_nodes":
  [[["activation_4", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_4",
  "trainable": true, "dtype": "float32", "target_shape": [7, 7, 64, 1]}, "name": "reshape_4",
  "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config":
  {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size":
  [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate":
  [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 64},
  "bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}, "shared_object_id":
  65}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes":
  [[["activation_4", 0, 0, {}]]]}, {"class_name": "ZeroPadding3D", "config": {"name":
  "zero_padding3d_2", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0,
  0], [0, 64]], "data_format": "channels_last"}, "name": "zero_padding3d_2", "inbound_nodes":
  [[["reshape_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_5",
  "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_5",
  "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Reshape", "config":
  {"name": "reshape_5", "trainable": true, "dtype": "float32", "target_shape": [7,
  7, 128]}, "name": "reshape_5", "inbound_nodes": [[["zero_padding3d_2", 0, 0, {}]]]},
  {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype":
  "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding":
  "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation":
  "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform",
  "config": {"seed": null}, "shared_object_id": 64}, "bias_initializer": {"class_name":
  "Constant", "config": {"value": 0.1}, "shared_object_id": 65}, "kernel_regularizer":
  null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint":
  null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["activation_5",
  0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true,
  "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["reshape_5", 0, 0, {}],
  ["conv2d_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_6",
  "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_6",
  "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name":
  "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"},
  "name": "flatten", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name":
  "Dense", "config": {"name": "fc_sigmoid", "trainable": true, "dtype": "float32",
  "units": 10, "activation": "sigmoid", "use_bias": false, "kernel_initializer": {"class_name":
  "GlorotUniform", "config": {"seed": null}, "shared_object_id": 33}, "bias_initializer":
  {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer":
  null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint":
  null}, "name": "fc_sigmoid", "inbound_nodes": [[["flatten", 0, 0, {}]]]}], "input_layers":
  [["input_1", 0, 0]], "output_layers": [["fc_sigmoid", 0, 0]]}, "name": "model",
  "inbound_nodes": [[["input_3", 0, 0, {}]], [["input_4", 0, 0, {}]], [["input_5",
  0, 0, {}]], [["input_6", 0, 0, {}]], [["input_7", 0, 0, {}]], [["input_8", 0, 0,
  {}]], [["input_9", 0, 0, {}]], [["input_10", 0, 0, {}]], [["input_11", 0, 0, {}]],
  [["input_12", 0, 0, {}]], [["input_13", 0, 0, {}]], [["input_14", 0, 0, {}]], [["input_15",
  0, 0, {}]], [["input_16", 0, 0, {}]], [["input_17", 0, 0, {}]], [["input_18", 0,
  0, {}]], [["input_19", 0, 0, {}]], [["input_20", 0, 0, {}]], [["input_21", 0, 0,
  {}]], [["input_22", 0, 0, {}]], [["input_23", 0, 0, {}]], [["input_24", 0, 0, {}]],
  [["input_25", 0, 0, {}]], [["input_26", 0, 0, {}]], [["input_27", 0, 0, {}]], [["input_28",
  0, 0, {}]], [["input_29", 0, 0, {}]], [["input_30", 0, 0, {}]], [["input_31", 0,
  0, {}]], [["input_32", 0, 0, {}]], [["input_33", 0, 0, {}]], [["input_34", 0, 0,
  {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_7", "trainable": true,
  "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_7", "inbound_nodes":
  [[["model", 1, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_9",
  "trainable": true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_9",
  "inbound_nodes": [[["model", 2, 0, {}]]]}, {"class_name": "Reshape", "config": {"name":
  "reshape_11", "trainable": true, "dtype": "float32", "target_shape": [1, -1]}, "name":
  "reshape_11", "inbound_nodes": [[["model", 3, 0, {}]]]}, {"class_name": "Reshape",
  "config": {"name": "reshape_13", "trainable": true, "dtype": "float32", "target_shape":
  [1, -1]}, "name": "reshape_13", "inbound_nodes": [[["model", 4, 0, {}]]]}, {"class_name":
  "Reshape", "config": {"name": "reshape_15", "trainable": true, "dtype": "float32",
  "target_shape": [1, -1]}, "name": "reshape_15", "inbound_nodes": [[["model", 5,
  0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_17", "trainable":
  true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_17", "inbound_nodes":
  [[["model", 6, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_19",
  "trainable": true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_19",
  "inbound_nodes": [[["model", 7, 0, {}]]]}, {"class_name": "Reshape", "config": {"name":
  "reshape_21", "trainable": true, "dtype": "float32", "target_shape": [1, -1]}, "name":
  "reshape_21", "inbound_nodes": [[["model", 8, 0, {}]]]}, {"class_name": "Reshape",
  "config": {"name": "reshape_23", "trainable": true, "dtype": "float32", "target_shape":
  [1, -1]}, "name": "reshape_23", "inbound_nodes": [[["model", 9, 0, {}]]]}, {"class_name":
  "Reshape", "config": {"name": "reshape_25", "trainable": true, "dtype": "float32",
  "target_shape": [1, -1]}, "name": "reshape_25", "inbound_nodes": [[["model", 10,
  0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_27", "trainable":
  true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_27", "inbound_nodes":
  [[["model", 11, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_29",
  "trainable": true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_29",
  "inbound_nodes": [[["model", 12, 0, {}]]]}, {"class_name": "Reshape", "config":
  {"name": "reshape_31", "trainable": true, "dtype": "float32", "target_shape": [1,
  -1]}, "name": "reshape_31", "inbound_nodes": [[["model", 13, 0, {}]]]}, {"class_name":
  "Reshape", "config": {"name": "reshape_33", "trainable": true, "dtype": "float32",
  "target_shape": [1, -1]}, "name": "reshape_33", "inbound_nodes": [[["model", 14,
  0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_35", "trainable":
  true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_35", "inbound_nodes":
  [[["model", 15, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_37",
  "trainable": true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_37",
  "inbound_nodes": [[["model", 16, 0, {}]]]}, {"class_name": "Reshape", "config":
  {"name": "reshape_39", "trainable": true, "dtype": "float32", "target_shape": [1,
  -1]}, "name": "reshape_39", "inbound_nodes": [[["model", 17, 0, {}]]]}, {"class_name":
  "Reshape", "config": {"name": "reshape_41", "trainable": true, "dtype": "float32",
  "target_shape": [1, -1]}, "name": "reshape_41", "inbound_nodes": [[["model", 18,
  0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_43", "trainable":
  true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_43", "inbound_nodes":
  [[["model", 19, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_45",
  "trainable": true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_45",
  "inbound_nodes": [[["model", 20, 0, {}]]]}, {"class_name": "Reshape", "config":
  {"name": "reshape_47", "trainable": true, "dtype": "float32", "target_shape": [1,
  -1]}, "name": "reshape_47", "inbound_nodes": [[["model", 21, 0, {}]]]}, {"class_name":
  "Reshape", "config": {"name": "reshape_49", "trainable": true, "dtype": "float32",
  "target_shape": [1, -1]}, "name": "reshape_49", "inbound_nodes": [[["model", 22,
  0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_51", "trainable":
  true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_51", "inbound_nodes":
  [[["model", 23, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_53",
  "trainable": true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_53",
  "inbound_nodes": [[["model", 24, 0, {}]]]}, {"class_name": "Reshape", "config":
  {"name": "reshape_55", "trainable": true, "dtype": "float32", "target_shape": [1,
  -1]}, "name": "reshape_55", "inbound_nodes": [[["model", 25, 0, {}]]]}, {"class_name":
  "Reshape", "config": {"name": "reshape_57", "trainable": true, "dtype": "float32",
  "target_shape": [1, -1]}, "name": "reshape_57", "inbound_nodes": [[["model", 26,
  0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_59", "trainable":
  true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_59", "inbound_nodes":
  [[["model", 27, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_61",
  "trainable": true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_61",
  "inbound_nodes": [[["model", 28, 0, {}]]]}, {"class_name": "Reshape", "config":
  {"name": "reshape_63", "trainable": true, "dtype": "float32", "target_shape": [1,
  -1]}, "name": "reshape_63", "inbound_nodes": [[["model", 29, 0, {}]]]}, {"class_name":
  "Reshape", "config": {"name": "reshape_65", "trainable": true, "dtype": "float32",
  "target_shape": [1, -1]}, "name": "reshape_65", "inbound_nodes": [[["model", 30,
  0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_67", "trainable":
  true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_67", "inbound_nodes":
  [[["model", 31, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_69",
  "trainable": true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape_69",
  "inbound_nodes": [[["model", 32, 0, {}]]]}, {"class_name": "Concatenate", "config":
  {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": 1}, "name":
  "concatenate", "inbound_nodes": [[["reshape_7", 0, 0, {}], ["reshape_9", 0, 0, {}],
  ["reshape_11", 0, 0, {}], ["reshape_13", 0, 0, {}], ["reshape_15", 0, 0, {}], ["reshape_17",
  0, 0, {}], ["reshape_19", 0, 0, {}], ["reshape_21", 0, 0, {}], ["reshape_23", 0,
  0, {}], ["reshape_25", 0, 0, {}], ["reshape_27", 0, 0, {}], ["reshape_29", 0, 0,
  {}], ["reshape_31", 0, 0, {}], ["reshape_33", 0, 0, {}], ["reshape_35", 0, 0, {}],
  ["reshape_37", 0, 0, {}], ["reshape_39", 0, 0, {}], ["reshape_41", 0, 0, {}], ["reshape_43",
  0, 0, {}], ["reshape_45", 0, 0, {}], ["reshape_47", 0, 0, {}], ["reshape_49", 0,
  0, {}], ["reshape_51", 0, 0, {}], ["reshape_53", 0, 0, {}], ["reshape_55", 0, 0,
  {}], ["reshape_57", 0, 0, {}], ["reshape_59", 0, 0, {}], ["reshape_61", 0, 0, {}],
  ["reshape_63", 0, 0, {}], ["reshape_65", 0, 0, {}], ["reshape_67", 0, 0, {}], ["reshape_69",
  0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable":
  true, "dtype": "float32", "function": "kde", "function_type": "function", "module":
  "model", "output_shape": null, "output_shape_type": "raw", "output_shape_module":
  null, "arguments": {"num_nodes": 11, "sigma": 0.1, "batch_size": 20, "num_features":
  10}}, "name": "lambda", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name":
  "Dense", "config": {"name": "fc_relu1", "trainable": true, "dtype": "float32", "units":
  384, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name":
  "GlorotUniform", "config": {"seed": null}, "shared_object_id": 33}, "bias_initializer":
  {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer":
  null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint":
  null}, "name": "fc_relu1", "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"class_name":
  "Functional", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer",
  "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse":
  false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes":
  [], "shared_object_id": 32}, {"class_name": "Conv2D", "config": {"name": "conv2d",
  "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides":
  [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1,
  1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 33},
  "bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}, "shared_object_id":
  34}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes":
  [[["input_1", 0, 0, {}]]], "shared_object_id": 35}, {"class_name": "Activation",
  "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation":
  "relu"}, "name": "activation", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "shared_object_id":
  36}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true,
  "dtype": "float32", "target_shape": [28, 28, 16, 1]}, "name": "reshape", "inbound_nodes":
  [[["activation", 0, 0, {}]]], "shared_object_id": 37}, {"class_name": "Conv2D",
  "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters":
  32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format":
  "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias":
  true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null},
  "shared_object_id": 38}, "bias_initializer": {"class_name": "Constant", "config":
  {"value": 0.1}, "shared_object_id": 39}, "kernel_regularizer": null, "bias_regularizer":
  null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint":
  null}, "name": "conv2d_1", "inbound_nodes": [[["activation", 0, 0, {}]]], "shared_object_id":
  40}, {"class_name": "ZeroPadding3D", "config": {"name": "zero_padding3d", "trainable":
  true, "dtype": "float32", "padding": [[0, 0], [0, 0], [0, 16]], "data_format": "channels_last"},
  "name": "zero_padding3d", "inbound_nodes": [[["reshape", 0, 0, {}]]], "shared_object_id":
  41}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable":
  true, "dtype": "float32", "activation": "relu"}, "name": "activation_1", "inbound_nodes":
  [[["conv2d_1", 0, 0, {}]]], "shared_object_id": 42}, {"class_name": "Reshape", "config":
  {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [28,
  28, 32]}, "name": "reshape_1", "inbound_nodes": [[["zero_padding3d", 0, 0, {}]]],
  "shared_object_id": 43}, {"class_name": "Conv2D", "config": {"name": "conv2d_2",
  "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides":
  [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1,
  1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 38},
  "bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}, "shared_object_id":
  39}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes":
  [[["activation_1", 0, 0, {}]]], "shared_object_id": 44}, {"class_name": "Add", "config":
  {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes":
  [[["reshape_1", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "shared_object_id": 45}, {"class_name":
  "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32",
  "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["add", 0, 0,
  {}]]], "shared_object_id": 46}, {"class_name": "Conv2D", "config": {"name": "conv2d_5",
  "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides":
  [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1,
  1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 47},
  "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 48},
  "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null,
  "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes":
  [[["activation_2", 0, 0, {}]]], "shared_object_id": 49}, {"class_name": "Reshape",
  "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape":
  [14, 14, 32, 1]}, "name": "reshape_2", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]],
  "shared_object_id": 50}, {"class_name": "Conv2D", "config": {"name": "conv2d_3",
  "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides":
  [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1,
  1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 51},
  "bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}, "shared_object_id":
  52}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes":
  [[["activation_2", 0, 0, {}]]], "shared_object_id": 53}, {"class_name": "ZeroPadding3D",
  "config": {"name": "zero_padding3d_1", "trainable": true, "dtype": "float32", "padding":
  [[0, 0], [0, 0], [0, 32]], "data_format": "channels_last"}, "name": "zero_padding3d_1",
  "inbound_nodes": [[["reshape_2", 0, 0, {}]]], "shared_object_id": 54}, {"class_name":
  "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32",
  "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["conv2d_3", 0,
  0, {}]]], "shared_object_id": 55}, {"class_name": "Reshape", "config": {"name":
  "reshape_3", "trainable": true, "dtype": "float32", "target_shape": [14, 14, 64]},
  "name": "reshape_3", "inbound_nodes": [[["zero_padding3d_1", 0, 0, {}]]], "shared_object_id":
  56}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true,
  "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding":
  "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation":
  "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform",
  "config": {"seed": null}, "shared_object_id": 51}, "bias_initializer": {"class_name":
  "Constant", "config": {"value": 0.1}, "shared_object_id": 52}, "kernel_regularizer":
  null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint":
  null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["activation_3",
  0, 0, {}]]], "shared_object_id": 57}, {"class_name": "Add", "config": {"name": "add_1",
  "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["reshape_3",
  0, 0, {}], ["conv2d_4", 0, 0, {}]]], "shared_object_id": 58}, {"class_name": "Activation",
  "config": {"name": "activation_4", "trainable": true, "dtype": "float32", "activation":
  "relu"}, "name": "activation_4", "inbound_nodes": [[["add_1", 0, 0, {}]]], "shared_object_id":
  59}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true,
  "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding":
  "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation":
  "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform",
  "config": {"seed": null}, "shared_object_id": 60}, "bias_initializer": {"class_name":
  "Zeros", "config": {}, "shared_object_id": 61}, "kernel_regularizer": null, "bias_regularizer":
  null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint":
  null}, "name": "conv2d_8", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "shared_object_id":
  62}, {"class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true,
  "dtype": "float32", "target_shape": [7, 7, 64, 1]}, "name": "reshape_4", "inbound_nodes":
  [[["conv2d_8", 0, 0, {}]]], "shared_object_id": 63}, {"class_name": "Conv2D", "config":
  {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size":
  [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate":
  [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 64},
  "bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}, "shared_object_id":
  65}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes":
  [[["activation_4", 0, 0, {}]]], "shared_object_id": 66}, {"class_name": "ZeroPadding3D",
  "config": {"name": "zero_padding3d_2", "trainable": true, "dtype": "float32", "padding":
  [[0, 0], [0, 0], [0, 64]], "data_format": "channels_last"}, "name": "zero_padding3d_2",
  "inbound_nodes": [[["reshape_4", 0, 0, {}]]], "shared_object_id": 67}, {"class_name":
  "Activation", "config": {"name": "activation_5", "trainable": true, "dtype": "float32",
  "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["conv2d_6", 0,
  0, {}]]], "shared_object_id": 68}, {"class_name": "Reshape", "config": {"name":
  "reshape_5", "trainable": true, "dtype": "float32", "target_shape": [7, 7, 128]},
  "name": "reshape_5", "inbound_nodes": [[["zero_padding3d_2", 0, 0, {}]]], "shared_object_id":
  69}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true,
  "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding":
  "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation":
  "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform",
  "config": {"seed": null}, "shared_object_id": 64}, "bias_initializer": {"class_name":
  "Constant", "config": {"value": 0.1}, "shared_object_id": 65}, "kernel_regularizer":
  null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint":
  null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["activation_5",
  0, 0, {}]]], "shared_object_id": 70}, {"class_name": "Add", "config": {"name": "add_2",
  "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["reshape_5",
  0, 0, {}], ["conv2d_7", 0, 0, {}]]], "shared_object_id": 71}, {"class_name": "Activation",
  "config": {"name": "activation_6", "trainable": true, "dtype": "float32", "activation":
  "relu"}, "name": "activation_6", "inbound_nodes": [[["add_2", 0, 0, {}]]], "shared_object_id":
  72}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true,
  "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes":
  [[["activation_6", 0, 0, {}]]], "shared_object_id": 73}, {"class_name": "Dense",
  "config": {"name": "fc_sigmoid", "trainable": true, "dtype": "float32", "units":
  10, "activation": "sigmoid", "use_bias": false, "kernel_initializer": {"class_name":
  "GlorotUniform", "config": {"seed": null}, "shared_object_id": 33}, "bias_initializer":
  {"class_name": "Zeros", "config": {}, "shared_object_id": 74}, "kernel_regularizer":
  null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint":
  null, "bias_constraint": null}, "name": "fc_sigmoid", "inbound_nodes": [[["flatten",
  0, 0, {}]]], "shared_object_id": 75}, {"class_name": "Functional", "config": {"name":
  "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape":
  [null, 10], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"},
  "name": "input_2", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name":
  "dense", "trainable": true, "dtype": "float32", "units": 6272, "activation": "linear",
  "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config":
  {"seed": null}, "shared_object_id": 33}, "bias_initializer": {"class_name": "Constant",
  "config": {"value": 0.1}}, "kernel_regularizer": null, "bias_regularizer": null,
  "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null},
  "name": "dense", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Reshape",
  "config": {"name": "reshape_6", "trainable": true, "dtype": "float32", "target_shape":
  [7, 7, 128]}, "name": "reshape_6", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name":
  "Activation", "config": {"name": "activation_7", "trainable": true, "dtype": "float32",
  "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["reshape_6",
  0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d",
  "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last",
  "interpolation": "nearest"}, "name": "up_sampling2d", "inbound_nodes": [[["activation_7",
  0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable":
  true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1,
  1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1],
  "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name":
  "GlorotUniform", "config": {"seed": null}, "shared_object_id": 119}, "bias_initializer":
  {"class_name": "Constant", "config": {"value": 0.1}, "shared_object_id": 120}, "kernel_regularizer":
  null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint":
  null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["up_sampling2d",
  0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable":
  true, "dtype": "float32", "activation": "relu"}, "name": "activation_8", "inbound_nodes":
  [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_10",
  "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides":
  [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1,
  1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 119},
  "bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}, "shared_object_id":
  120}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_10",
  "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Add", "config":
  {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes":
  [[["up_sampling2d", 0, 0, {}], ["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation",
  "config": {"name": "activation_9", "trainable": true, "dtype": "float32", "activation":
  "relu"}, "name": "activation_9", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name":
  "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "dtype":
  "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"},
  "name": "up_sampling2d_1", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name":
  "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32",
  "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format":
  "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias":
  true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null},
  "shared_object_id": 127}, "bias_initializer": {"class_name": "Constant", "config":
  {"value": 0.1}, "shared_object_id": 128}, "kernel_regularizer": null, "bias_regularizer":
  null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint":
  null}, "name": "conv2d_11", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]},
  {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true,
  "dtype": "float32", "activation": "relu"}, "name": "activation_10", "inbound_nodes":
  [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_13",
  "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides":
  [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1,
  1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name":
  "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_13",
  "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config":
  {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size":
  [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate":
  [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 127},
  "bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}, "shared_object_id":
  128}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_12",
  "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Add", "config":
  {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes":
  [[["conv2d_13", 0, 0, {}], ["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation",
  "config": {"name": "activation_11", "trainable": true, "dtype": "float32", "activation":
  "relu"}, "name": "activation_11", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name":
  "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "dtype": "float32",
  "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format":
  "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias":
  true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null},
  "shared_object_id": 137}, "bias_initializer": {"class_name": "Constant", "config":
  {"value": 0.1}, "shared_object_id": 138}, "kernel_regularizer": null, "bias_regularizer":
  null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint":
  null}, "name": "conv2d_14", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name":
  "Activation", "config": {"name": "activation_12", "trainable": true, "dtype": "float32",
  "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["conv2d_14",
  0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable":
  true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1],
  "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups":
  1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name":
  "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros",
  "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_16",
  "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config":
  {"name": "conv2d_15", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size":
  [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate":
  [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer":
  {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 137},
  "bias_initializer": {"class_name": "Constant", "config": {"value": 0.1}, "shared_object_id":
  138}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_15",
  "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "Add", "config":
  {"name": "add_5", "trainable": true, "dtype": "float32"}, "name": "add_5", "inbound_nodes":
  [[["conv2d_16", 0, 0, {}], ["conv2d_15", 0, 0, {}]]]}, {"class_name": "Activation",
  "config": {"name": "activation_13", "trainable": true, "dtype": "float32", "activation":
  "relu"}, "name": "activation_13", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name":
  "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "dtype": "float32",
  "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format":
  "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias":
  true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null},
  "shared_object_id": 33}, "bias_initializer": {"class_name": "Constant", "config":
  {"value": 0.1}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer":
  null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_17",
  "inbound_nodes": [[["activation_13", 0, 0, {}]]]}], "input_layers": [["input_2",
  0, 0]], "output_layers": [["conv2d_17", 0, 0]]}, "name": "model_1", "inbound_nodes":
  [[["fc_sigmoid", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers":
  [["model_1", 1, 0]]}, "name": "model_2", "inbound_nodes": [[["input_3", 0, 0, {}]],
  [["input_4", 0, 0, {}]], [["input_5", 0, 0, {}]], [["input_6", 0, 0, {}]], [["input_7",
  0, 0, {}]], [["input_8", 0, 0, {}]], [["input_9", 0, 0, {}]], [["input_10", 0, 0,
  {}]], [["input_11", 0, 0, {}]], [["input_12", 0, 0, {}]], [["input_13", 0, 0, {}]],
  [["input_14", 0, 0, {}]], [["input_15", 0, 0, {}]], [["input_16", 0, 0, {}]], [["input_17",
  0, 0, {}]], [["input_18", 0, 0, {}]], [["input_19", 0, 0, {}]], [["input_20", 0,
  0, {}]], [["input_21", 0, 0, {}]], [["input_22", 0, 0, {}]], [["input_23", 0, 0,
  {}]], [["input_24", 0, 0, {}]], [["input_25", 0, 0, {}]], [["input_26", 0, 0, {}]],
  [["input_27", 0, 0, {}]], [["input_28", 0, 0, {}]], [["input_29", 0, 0, {}]], [["input_30",
  0, 0, {}]], [["input_31", 0, 0, {}]], [["input_32", 0, 0, {}]], [["input_33", 0,
  0, {}]], [["input_34", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name":
  "fc_relu2", "trainable": true, "dtype": "float32", "units": 192, "activation": "relu",
  "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config":
